# CLI Tools
brew "git"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "htop"
brew "lazygit"
brew "lazysql"
brew "awscli"
brew "jq"
brew "yq"
brew "gh"
brew "delta"
brew "tmux"
brew "stow"
brew "neovim"
brew "starship"
brew "zoxide"
brew 'openssl'
brew "httpie"
brew "curlie"

# Languages n stuff
brew "mise"

# GNU Utilities
brew "coreutils"
brew "gnu-sed"
brew "findutils"
brew "gawk"

# GUI Applications
cask 'vlc'
cask 'spotify'
cask "raycast"
cask "docker-desktop"
cask "ghostty"
cask "aerospace"
cask "discord"
cask "shottr"

# Fonts
cask "font-jetbrains-mono-nerd-font"

